xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_WIFI.cpp
#ifdef ESP32_PLATFORM

#include <Arduino.h>

#include "BuildinStdlib.h"
#include "ESP32Driver/Esp32Driver.h"
#if ESP32_WEBSERVER_ENABLED
#include <WebServer.h>
#endif
#if ESP32_SOCKET_ENABLED
#include <WiFiClient.h>
#endif
#include <HTTPClient.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiServer.h>

#include "GC.h"
#include "StringConverter.h"
#include "VM.h"

#if ESP32_WIFI_API_ENABLED

#if ESP32_WEBSERVER_ENABLED
// 用于处理脚本HTTP处理程序回调的返回值，转换并发回请求方

void __ESP32_HTTP_SendBufferResp(uint32_t bufid, WebServer* pServer,
                                 std::string type, int code) {
  auto info = GetByteBufferInfo(bufid);
  printf("bufid=%d info.data=%p info.length=%d\n", bufid, info.data,
         info.length);
  pServer->send_P(code, type.c_str(), (const char*)info.data, info.length);
}

void __ESP32_HTTP_SendResponse(VariableValue& result, WebServer* pServer) {
  switch (result.getContentType()) {
    case ValueType::OBJECT:  // 详情信息啊
    {
      // 后续更新ButeBuffer了需要在这里判断
      //{content,code,type}
      auto& obj = result.content.ref->implement.objectImpl;
      if (obj.find("bufid") != obj.end()) {  // 判断是不是Buffer对象
        uint32_t bufid = (uint32_t)obj["bufid"].content.number;
        __ESP32_HTTP_SendBufferResp(bufid, pServer, "application/octet-stream",
                                    200);
      } else {
        int code = obj["code"].getContentType() == ValueType::NUM
                       ? (int)obj["code"].content.number
                       : 200;
        std::string type = obj["type"].ToString();
        auto contentValue = obj["content"];
        // 判断是不是Buffer对象
        if (contentValue.getContentType() == ValueType::OBJECT &&
            contentValue.content.ref->implement.objectImpl.find("bufid") !=
                contentValue.content.ref->implement.objectImpl.end()) {
          uint32_t bufid =
              (uint32_t)contentValue.content.ref->implement.objectImpl["bufid"]
                  .content.number;
          __ESP32_HTTP_SendBufferResp(bufid, pServer, type, code);

        } else {  // 序列化返回
          std::string content = contentValue.ToString();
          pServer->send(code, type.c_str(), content.c_str());
        }
      }
      break;
    }
    default:  // 其他的都toString后返回，懒得判断了，后续ByteBuffer就在顶上判断
    {
      std::string send = result.ToString();
      pServer->send(200, "text/plain", send.c_str());
      break;
    }
  }
}

#endif

#if ESP32_HTTPCLIENT_ENABLED
std::unordered_map<std::string, VariableValue> HTTPClientRespObjectTemplate;
void HTTPClientRespObjectTempInit() {
  // text() 方法
  HTTPClientRespObjectTemplate["text"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisVal,
         VMWorker* w) -> VariableValue {
        auto it = thisVal->implement.objectImpl.find("_buf");
        if (it != thisVal->implement.objectImpl.end()) {
          uint32_t bufid = (uint32_t)(*it).second.content.ref->implement.objectImpl["bufid"].content.number;
          auto bufinfo = GetByteBufferInfo(bufid);
          std::string str((const char*)bufinfo.data,bufinfo.length);
          return CreateReferenceVariable(w->VMInstance->currentGC->GC_NewStringObject(str));
        }
        return VariableValue();
      });

  // buffer() 方法
  HTTPClientRespObjectTemplate["buffer"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisVal,
         VMWorker* w) -> VariableValue {
        auto it = thisVal->implement.objectImpl.find("_buf");
        if (it != thisVal->implement.objectImpl.end()) {
          return it->second; //返回buffer对象本身
        }
        return VariableValue();
      });
}

#endif

#if ESP32_WEBSERVER_ENABLED

static std::unordered_map<uint32_t, std::unique_ptr<WebServer>>
    webserverInstances;  // 定义全局单例绑定表
static std::unordered_map<uint32_t, TaskHandle_t>
    webserverLoopTasks;  // 独立运行web服务循环的RTOS任务
static uint32_t webserverInstanceIdSeed = 1;

std::unordered_map<std::string, VariableValue> WebServerObjectTemplate;

void WebServerObjectTempInit() {
  // 创建析构函数销毁绑定的原生web服务对象
  WebServerObjectTemplate["finalize"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        // 销毁相关原生资源
        uint32_t nativeId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        // 检查并停止RTOS任务
        if (webserverLoopTasks.find(nativeId) != webserverLoopTasks.end()) {
          vTaskDelete(webserverLoopTasks[nativeId]);
          webserverLoopTasks.erase(nativeId);
        }
        printf("WebServer.finalize: single map size=%d\n",
               webserverInstances.size());
        webserverInstances.erase(nativeId);
        printf("WebServer.finalize: erased single map size=%d\n",
               webserverInstances.size());
        return CreateBooleanVariable(true);  // 允许GC回收对象
      });
  // 准备操作方法
  WebServerObjectTemplate["begin"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t nativeId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        auto pServer = webserverInstances[nativeId].get();
        pServer->begin();
        TaskHandle_t serverLoopHandle = NULL;
        xTaskCreate(
            [](void* hArg) {
              uint32_t nativeId = (uint32_t)hArg;
              WebServer* web = webserverInstances[nativeId].get();
              while (true) {
                web->handleClient();
              }
            },
            "WebProcess", 6 * 1024, (void*)nativeId, 1, &serverLoopHandle);
        if (serverLoopHandle) {
          webserverLoopTasks[nativeId] = serverLoopHandle;
        } else {
          currentWorker->ThrowError("start server failed");
        }
        return VariableValue();
      });
  // mapxx(url,callback)
  WebServerObjectTemplate["mapGet"] = VM::CreateSystemFunc(
      2,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("url must be a string");
          return VariableValue();
        }
        if (args[1].getContentType() != ValueType::FUNCTION &&
            args[1].content.function->type != ScriptFunction::Local &&
            args[1].content.function->funcImpl.local_func.arguments.size() !=
                1) {
          currentWorker->ThrowError("invaild callback");
          return VariableValue();
        }

