xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_WIFI.cpp
        // 将回调对象存入this._cb中，防止GC误回收
        thisValue->implement.objectImpl["_cb"]
            .content.ref->implement.arrayImpl.push_back(args[1]);
        VariableValue callback = args[1];  // 拷贝持有一份闭包

        uint32_t nativeId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        auto pServer = webserverInstances[nativeId].get();
        VM* currentVM = currentWorker->VMInstance;
        // 实现回调层
        pServer->on(
            args[0].content.ref->implement.stringImpl.c_str(),
            [nativeId, currentVM, callback]() {
              VariableValue _callback = callback;
              auto pServer = webserverInstances[nativeId].get();
              // 不从GC分配，减轻GC压力和内存碎片
              VMObject argObject(ValueType::OBJECT);
              std::vector<VMObject*> paramObjects;
              paramObjects.reserve(
                  pServer->args());  // 预留参数空位避免扩容导致指针失效
              auto& aobjmap = argObject.implement.objectImpl;
              // 拷贝参数过去
              for (int i = 0; i < pServer->args(); i++) {
                std::string argName = pServer->argName(i).c_str();
                std::string param = pServer->arg(i).c_str();
                // paramObjects.emplace_back(ValueType::STRING);
                // paramObjects.back().implement.stringImpl = w_param;
                VMObject* vmo = new VMObject(
                    ValueType::
                        STRING);  // 创建临时的字符串对象，回调返回后需要遍历delete
                vmo->implement.stringImpl = param;
                paramObjects.push_back(vmo);
                aobjmap[argName] = CreateReferenceVariable(vmo);
              }
              // 在新的执行环境执行回调
              // VMWorker worker(currentVM);

              std::vector<VariableValue> argument;
              argument.push_back(CreateReferenceVariable(&argObject));
              // auto result =
              // worker->Init(callback->funcImpl.local_func,&argument);
              // //当前线程运行解释器循环
              auto result =
                  currentVM->InvokeCallback(_callback, argument, NULL);
              // 发送返回值作为response

              __ESP32_HTTP_SendResponse(result, pServer);

              // 清理临时对象
              for (VMObject* paramobj : paramObjects) {
                delete paramobj;
              }
            });
        return VariableValue();
      });
  WebServerObjectTemplate["mapPost"] = VM::CreateSystemFunc(
      2,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("url must be a string");
          return VariableValue();
        }
        if (args[1].getContentType() != ValueType::FUNCTION &&
            args[1].content.function->type != ScriptFunction::Local &&
            args[1].content.function->funcImpl.local_func.arguments.size() !=
                1) {
          currentWorker->ThrowError("invaild callback");
          return VariableValue();
        }
        // 将回调对象存入this._cb中，防止GC误回收
        thisValue->implement.objectImpl["_cb"]
            .content.ref->implement.arrayImpl.push_back(args[1]);
        VariableValue callback = args[1];  // 拷贝持有一份闭包

        uint32_t nativeId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
        auto pServer = webserverInstances[nativeId].get();
        VM* currentVM = currentWorker->VMInstance;
        // 实现回调层
        pServer->on(
            args[0].content.ref->implement.stringImpl.c_str(), HTTP_POST,
            [nativeId, currentVM, callback]() {
              VariableValue _callback = callback;
              auto pServer = webserverInstances[nativeId].get();
              // 不从GC分配，减轻GC压力和内存碎片
              VMObject argObject(ValueType::OBJECT);
              std::vector<VMObject*> paramObjects;
              paramObjects.reserve(
                  pServer->args());  // 预留参数空位避免扩容导致指针失效
              auto& aobjmap = argObject.implement.objectImpl;
              // 拷贝参数过去
              for (int i = 0; i < pServer->args(); i++) {
                // 转换成UTF16给引擎回调
                std::string argName = pServer->argName(i).c_str();
                std::string param = pServer->arg(i).c_str();
                // paramObjects.emplace_back(ValueType::STRING);
                // paramObjects.back().implement.stringImpl = w_param;
                VMObject* vmo = new VMObject(
                    ValueType::
                        STRING);  // 创建临时的字符串对象，回调返回后需要遍历delete
                vmo->implement.stringImpl = param;
                paramObjects.push_back(vmo);
                aobjmap[argName] = CreateReferenceVariable(vmo);
              }
              // 在新的执行环境执行回调
              // VMWorker worker(currentVM);

              std::vector<VariableValue> argument;
              argument.push_back(CreateReferenceVariable(&argObject));
              // auto result =
              // worker->Init(callback->funcImpl.local_func,&argument);
              // //当前线程运行解释器循环
              auto result =
                  currentVM->InvokeCallback(_callback, argument, NULL);
              // 发送返回值作为response

              __ESP32_HTTP_SendResponse(result, pServer);

              // 清理临时对象
              for (VMObject* paramobj : paramObjects) {
                delete paramobj;
              }
            });
        return VariableValue();
      });
}

#endif

void ESP32_HTTPApi_Init(VM* VMInstance) {
#if ESP32_HTTPCLIENT_ENABLED || ESP32_WEBSERVER_ENABLED
  VMObject* httpClass = VMInstance->currentGC->GC_NewObject(ValueType::OBJECT);
#endif

#if ESP32_HTTPCLIENT_ENABLED

  HTTPClientRespObjectTempInit();
  httpClass->implement.objectImpl["fetch"] = VM::CreateSystemFunc(
      DYNAMIC_ARGUMENT,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args.empty() || args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("fetch(url, [options])");
          return VariableValue();
        }

