xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_WIFI.cpp
        String url = String(args[0].content.ref->implement.stringImpl.c_str());
        String method = "GET";
        String body = "";

        if (args.size() > 1 && args[1].getContentType() == ValueType::OBJECT) {
          VMObject* options = args[1].content.ref;

          auto it_method = options->implement.objectImpl.find("method");
          if (it_method != options->implement.objectImpl.end() &&
              it_method->second.getContentType() == ValueType::STRING) {
            method = String(
                it_method->second.content.ref->implement.stringImpl.c_str());
            method.toUpperCase();
          }

          auto it_body = options->implement.objectImpl.find("body");
          if (it_body != options->implement.objectImpl.end() &&
              it_body->second.getContentType() == ValueType::STRING) {
            body = String(
                it_body->second.content.ref->implement.stringImpl.c_str());
          }
        }

        HTTPClient http;
        if (!http.begin(url)) {
          currentWorker->ThrowError("HTTPClient.begin failed");
          return VariableValue();
        }

        int httpCode = 0;
        if (method == "GET")
          httpCode = http.GET();
        else if (method == "POST") {
          http.addHeader("Content-Type", "application/json");
          httpCode = http.POST(body);
        } else if (method == "PUT") {
          http.addHeader("Content-Type", "application/json");
          httpCode = http.PUT(body);
        } else if (method == "DELETE")
          httpCode = http.sendRequest("DELETE");
        else
          httpCode = http.GET();

        VMObject* bufferObject;
        if (httpCode > 0) {
          bufferObject = CreateByteBufferObject(http.getSize(),currentWorker);
          uint32_t bufid = (uint32_t)bufferObject->implement.objectImpl["bufid"].content.number;
          auto info = GetByteBufferInfo(bufid);
          uint32_t offset = 0;
          while(offset < info.length && http.getStream().available()){
            offset += http.getStream().readBytes(info.data + offset,info.length - offset);
          }
        }
        http.end();

        // 创建响应对象
        VMObject* response = currentWorker->VMInstance->currentGC->GC_NewObject(
            ValueType::OBJECT);

        response->implement.objectImpl =
            HTTPClientRespObjectTemplate;  // 拷贝响应对象模板

        // 基本属性
        bool ok = httpCode >= 200 && httpCode < 300;
        response->implement.objectImpl["ok"] = CreateBooleanVariable(ok);
        response->implement.objectImpl["status"] =
            CreateNumberVariable(httpCode);

        // 状态文本
        VMObject* statusTextObj =
            currentWorker->VMInstance->currentGC->GC_NewStringObject(
                String(httpCode).c_str());
        response->implement.objectImpl["statusText"] =
            CreateReferenceVariable(statusTextObj);

        // URL
        response->implement.objectImpl["url"] = args[0];

        // 内部body存储
        response->implement.objectImpl["_buf"] =
            CreateReferenceVariable(bufferObject);

        return CreateReferenceVariable(response);
      });
#endif

#if ESP32_WEBSERVER_ENABLED

  WebServerObjectTempInit();
  httpClass->implement.objectImpl["createServer"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("port must be number");
          return VariableValue();
        }

        uint32_t port = (uint32_t)args[0].content.number;

        VMObject* serverObject =
            currentWorker->VMInstance->currentGC->GC_NewObject(
                ValueType::OBJECT);

        serverObject->implement.objectImpl =
            WebServerObjectTemplate;  // 拷贝对象模板

        auto& objContainer = serverObject->implement.objectImpl;
        uint32_t serverId = webserverInstanceIdSeed++;

        WebServer* nativeWebServer = new WebServer(80);
        webserverInstances[serverId] =
            std::unique_ptr<WebServer>(nativeWebServer);
        objContainer["_id"] = CreateNumberVariable((double)serverId);
        objContainer["port"] = CreateNumberVariable(args[0].content.number);
        objContainer["_cb"] = CreateReferenceVariable(
            currentWorker->VMInstance->currentGC->GC_NewObject(
                ValueType::ARRAY));

        return CreateReferenceVariable(serverObject);
      });
#endif

#if ESP32_HTTPCLIENT_ENABLED || ESP32_WEBSERVER_ENABLED
  std::string httpClassName = "Http";
  auto httpClassRef = CreateReferenceVariable(httpClass);
  VMInstance->storeGlobalSymbol(httpClassName, httpClassRef);
#endif
}

#if ESP32_SOCKET_ENABLED

std::unordered_map<std::string, VariableValue> TCPSocketObjectTemplate;
static std::unordered_map<uint32_t, std::unique_ptr<WiFiClient>>
    tcpclientInstances;
static uint32_t tcpclientInstanceIdSeed = 1;

bool receiveExactSize(WiFiClient& client, uint8_t* buffer, size_t size) {
  size_t received = 0;

  while (received < size) {
    if (client.available()) {
      int len = client.read(buffer + received, size - received);
      if (len > 0) {
        received += len;
      }
    }

    delay(1);
  }
  return true;
}

void TCPSocketObjectTempInit() {
  // 创建析构函数
  TCPSocketObjectTemplate["finalize"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t nativeId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (tcpclientInstances.find(nativeId) != tcpclientInstances.end()) {
          // 直接释放资源，不需要检查连接状态
          tcpclientInstances.erase(nativeId);
        }

        return CreateBooleanVariable(true);
      });

  // 发送数据 (buf,offset,length)
  TCPSocketObjectTemplate["send"] = VM::CreateSystemFunc(
      3,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[2].getContentType() != ValueType::NUM ||
            args[1].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("invaild argument type");
          return VariableValue();
        }
        uint32_t offset = (uint32_t)args[1].content.number;
        uint32_t length = (uint32_t)args[2].content.number;
        if (args[0].getContentType() == ValueType::OBJECT) {
          auto& obj = args[0].content.ref->implement.objectImpl;
          if (obj.find("bufid") != obj.end()) {
            uint32_t bufid = obj["bufid"].content.number;
            auto bufinfo = GetByteBufferInfo(bufid);
            if (!bufinfo.data) {
              currentWorker->ThrowError("invaild Buffer");
              return VariableValue();
            }
            uint32_t nativeId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            if (tcpclientInstances.find(nativeId) == tcpclientInstances.end()) {
              currentWorker->ThrowError("connection has closed");
              return VariableValue();
            }
            WiFiClient* client = tcpclientInstances[nativeId].get();
            if (!client->connected()) {
              currentWorker->ThrowError("connection has closed");
              return VariableValue();
            }
            if (offset >= bufinfo.length || offset + length > bufinfo.length ||
                length <= 0) {
              currentWorker->ThrowError("out of range");
              return VariableValue();
            }
            client->write_P((const char*)(bufinfo.data + offset), length);
            return VariableValue();
          }
        }
        currentWorker->ThrowError("send only apply Buffer");
        return VariableValue();
      });

  // recv(buf,offset,buf_length) : number 返回值表示收到的大小
  TCPSocketObjectTemplate["recv"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[2].getContentType() != ValueType::NUM ||
            args[1].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("invaild argument type");
          return VariableValue();
        }
        uint32_t offset = (uint32_t)args[1].content.number;
        uint32_t length = (uint32_t)args[2].content.number;
        if (args[0].getContentType() == ValueType::OBJECT) {
          auto& obj = args[0].content.ref->implement.objectImpl;
          if (obj.find("bufid") != obj.end()) {
            uint32_t bufid = obj["bufid"].content.number;
            auto bufinfo = GetByteBufferInfo(bufid);
            if (!bufinfo.data) {
              currentWorker->ThrowError("invaild Buffer");
              return VariableValue();
            }
            uint32_t nativeId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            if (tcpclientInstances.find(nativeId) == tcpclientInstances.end()) {
              currentWorker->ThrowError("connection has closed");
              return VariableValue();
            }
            WiFiClient* client = tcpclientInstances[nativeId].get();
            if (!client->connected()) {
              currentWorker->ThrowError("connection has closed");
              return VariableValue();
            }
            if (offset >= bufinfo.length || offset + length > bufinfo.length ||
                length <= 0) {
              currentWorker->ThrowError("out of range");
              return VariableValue();
            }
            uint32_t ret = client->readBytes(bufinfo.data + offset, length);
            return CreateNumberVariable(ret);
          }
        }
        currentWorker->ThrowError("send only apply Buffer");
        return VariableValue();
      });
  // recvSize(buf,offset,buf_length) : boolean
  TCPSocketObjectTemplate["recvSize"] = VM::CreateSystemFunc(
      3,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[2].getContentType() != ValueType::NUM ||
            args[1].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("invaild argument type");
          return VariableValue();
        }
        uint32_t offset = (uint32_t)args[1].content.number;
        uint32_t length = (uint32_t)args[2].content.number;
        if (args[0].getContentType() == ValueType::OBJECT) {
          auto& obj = args[0].content.ref->implement.objectImpl;
          if (obj.find("bufid") != obj.end()) {
            uint32_t bufid = obj["bufid"].content.number;
            auto bufinfo = GetByteBufferInfo(bufid);
            if (!bufinfo.data) {
              currentWorker->ThrowError("invaild Buffer");
              return VariableValue();
            }
            uint32_t nativeId =
                (uint32_t)thisValue->implement.objectImpl["_id"].content.number;
            if (tcpclientInstances.find(nativeId) == tcpclientInstances.end()) {
              currentWorker->ThrowError("connection has closed");
              return VariableValue();
            }
            WiFiClient* client = tcpclientInstances[nativeId].get();
            if (!client->connected()) {
              currentWorker->ThrowError("connection has closed");
              return VariableValue();
            }
            if (offset >= bufinfo.length || offset + length > bufinfo.length ||
                length <= 0) {
              currentWorker->ThrowError("out of range");
              return VariableValue();
            }
            bool ret = receiveExactSize(*client, bufinfo.data, bufinfo.length);
            return CreateBooleanVariable(ret);
          }
        }
        currentWorker->ThrowError("send only apply Buffer");
        return VariableValue();
      });

  // 检查连接状态
  TCPSocketObjectTemplate["isConnected"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t nativeId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (tcpclientInstances.find(nativeId) == tcpclientInstances.end()) {
          return CreateBooleanVariable(false);
        }

        WiFiClient* client = tcpclientInstances[nativeId].get();
        bool isConnected = client->connected();

        if (!isConnected) {
          tcpclientInstances.erase(nativeId);
        }

        return CreateBooleanVariable(isConnected);
      });

  // 断开连接
  TCPSocketObjectTemplate["close"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t nativeId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (tcpclientInstances.find(nativeId) != tcpclientInstances.end()) {
          tcpclientInstances.erase(nativeId);
        }

