xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_WIFI.cpp
        return CreateBooleanVariable(true);
      });

  // 设置超时
  TCPSocketObjectTemplate["setTimeout"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("timeout must be a number");
          return VariableValue();
        }

        uint32_t nativeId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (tcpclientInstances.find(nativeId) != tcpclientInstances.end()) {
          tcpclientInstances[nativeId]->setTimeout((int)args[0].content.number);
          return CreateBooleanVariable(true);
        }

        return CreateBooleanVariable(false);
      });
}

void ESP32_SocketApi_Init(VM* VMInstance) {
  TCPSocketObjectTempInit();
  VMObject* socketClass =
      VMInstance->currentGC->GC_NewObject(ValueType::OBJECT);
  socketClass->implement.objectImpl["connectTCP"] = VM::CreateSystemFunc(
      2,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING ||
            args[1].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("invaild argument type");
          return VariableValue();
        }

        std::string ipstr = args[0].content.ref->implement.stringImpl;
        ;
        uint16_t port = (uint16_t)args[1].content.number;

        IPAddress ipAddr;
        if (!ipAddr.fromString(ipstr.c_str())) {
          currentWorker->ThrowError("invalid IP address format");
          return VariableValue();
        }

        // 先尝试连接，成功后再创建VM对象
        WiFiClient* nativeClient = new WiFiClient();
        bool connected = nativeClient->connect(ipAddr, port);

        if (!connected) {
          delete nativeClient;  // 连接失败，立即释放内存
          currentWorker->ThrowError("connection failed");
          return VariableValue();
        }

        // 连接成功，创建VM对象
        uint32_t clientId = tcpclientInstanceIdSeed++;
        tcpclientInstances[clientId] =
            std::unique_ptr<WiFiClient>(nativeClient);

        VMObject* socketObject =
            currentWorker->VMInstance->currentGC->GC_NewObject(
                ValueType::OBJECT);

        socketObject->implement.objectImpl =
            TCPSocketObjectTemplate;  // 拷贝对象模板

        auto& objContainer = socketObject->implement.objectImpl;

        objContainer["_id"] = CreateNumberVariable((double)clientId);
        objContainer["ip"] = args[0];
        objContainer["port"] = CreateNumberVariable(args[1].content.number);
        objContainer["connected"] = CreateBooleanVariable(true);

        return CreateReferenceVariable(socketObject);
      });

  std::string socketClassName = "Socket";
  auto socketClassRef = CreateReferenceVariable(socketClass);
  VMInstance->storeGlobalSymbol(socketClassName, socketClassRef);
}

#endif

void ESP32_NetworkApi_Init(VM* VMInstance) {
#if ESP32_WEBSERVER_ENABLED
  ESP32_HTTPApi_Init(VMInstance);
#endif
#if ESP32_SOCKET_ENABLED
  ESP32_SocketApi_Init(VMInstance);
#endif
}

void ESP32_WifiHardwareApi_Init(VM* VMInstance) {
  VMObject* wifiClass = VMInstance->currentGC->GC_NewObject(ValueType::OBJECT);
  wifiClass->implement.objectImpl["softAP"] = VM::CreateSystemFunc(
      DYNAMIC_ARGUMENT,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        // WiFi.softAP(ssid);
        if (args.size() == 1 && args[0].getContentType() == ValueType::STRING) {
          std::string ssid = args[0].content.ref->implement.stringImpl;
          bool result = WiFi.softAP(ssid.c_str());
          return CreateBooleanVariable(result);
        }  // WiFi.softAP(ssid,pass);
        else if (args.size() == 2 &&
                 args[0].getContentType() == ValueType::STRING &&
                 args[1].getContentType() == ValueType::STRING) {
          std::string ssid = args[0].content.ref->implement.stringImpl;
          std::string password = args[1].content.ref->implement.stringImpl;
          bool result = WiFi.softAP(ssid.c_str(), password.c_str());
          return CreateBooleanVariable(result);
        } else {
          currentWorker->ThrowError("softAP() invaild argument");
          return VariableValue();
        }
      });
  wifiClass->implement.objectImpl["connect"] = VM::CreateSystemFunc(
      DYNAMIC_ARGUMENT,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        // WiFi.connect(ssid);
        if (args.size() == 1 && args[0].getContentType() == ValueType::STRING) {
          std::string ssid = args[0].content.ref->implement.stringImpl;
          bool result = WiFi.begin(ssid.c_str());
          return CreateBooleanVariable(result);
        }  // WiFi.connect(ssid,pass);
        else if (args.size() == 2 &&
                 args[0].getContentType() == ValueType::STRING &&
                 args[1].getContentType() == ValueType::STRING) {
          std::string ssid = args[0].content.ref->implement.stringImpl;
          std::string password = args[1].content.ref->implement.stringImpl;
          bool result = WiFi.begin(ssid.c_str(), password.c_str());
          return CreateBooleanVariable(result);
        } else {
          currentWorker->ThrowError("WiFi.connect() invaild argument");
          return VariableValue();
        }
      });
  wifiClass->implement.objectImpl["isConnected"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        return CreateBooleanVariable(WiFi.status() == WL_CONNECTED);
      });
  wifiClass->implement.objectImpl["setMode"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::STRING) {
          currentWorker->ThrowError("setMode invaild argument");
        }
        auto& mode = args[0].content.ref->implement.stringImpl;
        if (mode == "ap") {
          WiFi.mode(WIFI_MODE_AP);
        } else if (mode == "sta") {
          WiFi.mode(WIFI_MODE_STA);
        } else if (mode == "ap_sta") {
          WiFi.mode(WIFI_MODE_APSTA);
        } else if (mode == "none") {
          WiFi.mode(WIFI_MODE_NULL);
        } else {
          currentWorker->ThrowError("setMode unknown command " + mode);
        }

        return VariableValue();
      });

