xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_WIFI.cpp
  // WiFi.localIP
  wifiClass->implement.objectImpl["localIP"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        IPAddress ip = WiFi.localIP();
        String ipStr = String(ip[0]) + "." + String(ip[1]) + "." +
                       String(ip[2]) + "." + String(ip[3]);
        VMObject* strObj =
            currentWorker->VMInstance->currentGC->GC_NewStringObject(
                ipStr.c_str());
        return CreateReferenceVariable(strObj);
      });

  // WiFi.SSID
  wifiClass->implement.objectImpl["SSID"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        String ssid = WiFi.SSID();
        VMObject* strObj =
            currentWorker->VMInstance->currentGC->GC_NewStringObject(
                ssid.c_str());
        return CreateReferenceVariable(strObj);
      });

  // WiFi.RSSI
  wifiClass->implement.objectImpl["RSSI"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        int32_t rssi = WiFi.RSSI();
        return CreateNumberVariable(rssi);
      });

  // WiFi.macAddress
  wifiClass->implement.objectImpl["macAddress"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        String mac = WiFi.macAddress();
        VMObject* strObj =
            currentWorker->VMInstance->currentGC->GC_NewStringObject(
                mac.c_str());
        return CreateReferenceVariable(strObj);
      });

  std::string className = "WiFi";
  auto ref = CreateReferenceVariable(wifiClass);
  VMInstance->storeGlobalSymbol(className, ref);
}

void ESP32_WiFiPlatformApi_Init(VM* VMInstance) {
  ESP32_WifiHardwareApi_Init(VMInstance);
  ESP32_NetworkApi_Init(VMInstance);
}

#endif

#endif